Revit 2027 API
BuiltInFailures.RebarCouplerFailures.CantKeepConstraintsToBars Property
 The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantKeepConstraintsToBars { get; }
Public Shared ReadOnly Property CantKeepConstraintsToBars As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantKeepConstraintsToBars {
	FailureDefinitionId^ get ();
}
static member CantKeepConstraintsToBars : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace